1) Многопоточность. Ключевые слова volatile, synchronized. Методы notify, notifyAll, wait.
volatile Гарантирует, что изменения в переменной будут немедленно видны всем потокам.
synchronized Обеспечивает синхронизированный доступ к объекту, гарантируя, что только один поток может получить к нему доступ в любой момент времени.
notify Уведомляет один ожидающий поток о том, что объект изменился.
notifyAll Уведомляет все ожидающие потоки о том, что объект изменился.
wait Заставляет поток перейти в состояние ожидания, пока не будет вызван метод notify() или notifyAll().

2) Класс ArrayDeque. Основные реализации. Как работают вставка, удаление, поиск элемента на примере одной из реализаций.

ArrayDeque - это реализации очереди с двойным окончанием, которая позволяет вставлять и удалять элементы как с начала, так и с конца очереди.

Основные реализации:
LinkedList-based ArrayDeque: Реализует очередь с двойным окончанием на основе связанного списка.
Circular Array-based ArrayDeque: Реализует очередь с двойным окончанием на основе циклического массива.

Вставка элемента (LinkedList-based ArrayDeque):

Создается новый узел списка и добавляется в начало или конец списка в зависимости от указанного индекса.Узлы списка перестраиваются для поддержания порядка элементов.
Удаление элемента (LinkedList-based ArrayDeque):
Удаляется первый или последний узел списка в зависимости от указанного индекса.Узлы списка перестраиваются для поддержания порядка элементов.

Поиск элемента (LinkedList-based ArrayDeque):
Происходит последовательный перебор узлов списка с начала или конца списка, пока не будет найден элемент. Время поиска пропорционально размеру очереди.